modules/dsb-saajutils/src/test/resources/soapmessage1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:api="http://api.ws.dsb.petalslink.org/">
	<soapenv:Header />
	<soapenv:Body>
		<api:sayHello>
			<!--Optional: -->
			<arg0>?</arg0>
		</api:sayHello>
	</soapenv:Body>
</soapenv:Envelope>